workstation/openfoam-master-tutorials/tutorials/heatTransfer/chtMultiRegionTwoPhaseEulerFoam/solidQuenching2D/0.orig/water/U.gas
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    maxY
    {
        type            pressureInletOutletVelocity;
        phi             phi.gas;
        value           uniform ( 0 0 0 );
        inletValue      uniform ( 0 0 0 );
    }

    maxX
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }

    minY
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }

    water_to_solid
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
