workstation/openfoam-master-tutorials/tutorials/heatTransfer/chtMultiRegionTwoPhaseEulerFoam/solidQuenching2D/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    heater
    {
        name    heaterCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (-0.01 29e-3 -1) (4.77e-3 70e-3 1);
    }

    {
        name    solid;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     heaterCellSet;
    }

    {
        name    bottomWaterCellSet;
        type    cellSet;
        action  new;
        source  cellToCell;
        set     heaterCellSet;
    }

    {
        name    bottomWaterCellSet;
        type    cellSet;
        action  invert;
    }

    {
        name    water;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     bottomWaterCellSet;
    }
);


// ************************************************************************* //
